CSI API ETABS v1
cAreaElm.GetProperty Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetProperty(
	string Name,
	ref string PropName
)
Function GetProperty (
	Name As String,
	ByRef PropName As String
) As Integer
Dim instance As cAreaElm
Dim Name As String
Dim PropName As String
Dim returnValue As Integer
returnValue = instance.GetProperty(Name,
	PropName)
int GetProperty(
	String^ Name,
	String^% PropName
)
abstract GetProperty :
        Name : string *
        PropName : string byref -> int
Parameters
Name
Type: System.String
PropName
Type: System.String
Return Value
Type: Int32
See Also
Reference
cAreaElm Interface
ETABSv1 Namespace